Revit 2027 API
DisciplineTypeId.Infrastructure Property
 Infrastructure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Infrastructure { get; }
Public Shared ReadOnly Property Infrastructure As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Infrastructure {
	ForgeTypeId^ get ();
}
static member Infrastructure : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
DisciplineTypeId Class
Autodesk.Revit.DB Namespace